import ui_module
from select_options import select_options

# -----------------------------------------------------------------------------------------------------------------------

def main():
    ui_module.show_welcome()

    is_running = True

    while is_running:
        ui_module.show_menu()
        is_running = select_options()

# ----------------------------------------------------------------------------------------------------------------------
# Вызов только с главного модуля(тут)

if __name__ == '__main__':
    main()

# ----------------------------------------------------------------------------------------------------------------------

